<!-- dflook/terraform-github-actions {"workspace":"default","backend":"1963817845b9c306f14264b132a2483805b044ad7dc4de591985b5c241a5a182","backend_type":"s3"} -->
Terraform plan in __.__
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.bastion[0] must be replaced
-/+ resource "aws_instance" "bastion" {
      ~ arn                                  = "arn:aws:ec2:eu-west-2:664944010770:instance/i-02e07ee7b88848ca2" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + host_id                              = (known after apply)
      ~ id                                   = "*******************" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply) # forces replacement
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "*********************" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-37.eu-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.37" -> (known after apply)
      ~ public_dns                           = "ec2-18-170-224-42.eu-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.170.224.42" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      ~ subnet_id                            = "************************" -> (known after apply)
        tags                                 = {
            "Name" = "bastion-00"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ddc0c90ef47bb160",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "********" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }


      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "*********************" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # aws_key_pair.bastion will be created
  + resource "aws_key_pair" "bastion" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "*********"
      + tags_all        = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [terraform #36](https://github.com/hybridaccess/aws-infra/actions/runs/2484128753)